<!-- add-pr-comment:add-pr-comment -->

## Terraform CloudWatch Alarms plan
```
data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorised_users_modify_repository_settings_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorised_users_modify_repository_settings_alarms[0].data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.levgorbunov1_cancel_workflow_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorised_users_modify_repository_settings_alarms[5].data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorised_users_modify_repository_settings_mod_platform_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEventsModPlatform]
module.unauthorised_users_modify_repository_settings_mod_platform_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEventsModPlatformAlarm]
module.unauthorised_users_modify_repository_settings_alarms[1].data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorised_users_modify_repository_settings_alarms[4].data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.modernisation_platform_topic.aws_sns_topic.sns_topic: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts]
module.unauthorised_users_modify_repository_settings_alarms[2].data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorised_users_modify_repository_settings_alarms[1].data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorised_users_modify_repository_settings_alarms[4].data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorised_users_modify_repository_settings_alarms[3].data.aws_cloudwatch_log_group.github_events_log_group: Reading...
data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.operations_engineering_topic.aws_sns_topic.sns_topic: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts]
module.unauthorised_users_modify_repository_settings_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorised_users_modify_repository_settings_alarms[5].data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEvents]
module.levgorbunov1_cancel_workflow_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorised_users_modify_repository_settings_alarms[0].data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=Levgorbunov1CancelWorkflowEvents]
module.modernisation_platform_topic.aws_sns_topic_subscription.email_subscription["modernisation-platform@digital.justice.gov.uk"]: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts:71e5486e-76ed-4087-956f-aa5a8a1ad47f]
module.modernisation_platform_topic.aws_sns_topic_subscription.email_subscription["kudzai.mtoko@digital.justice.gov.uk"]: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts:8081d210-5220-4ade-a569-7987f14797ef]
module.unauthorised_users_modify_repository_settings_alarms[2].data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorised_users_modify_repository_settings_alarms[3].data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.operations_engineering_topic.aws_sns_topic_subscription.email_subscription["lev.gorbunov@digital.justice.gov.uk"]: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts:27741290-2203-45ed-8cd0-9982d078f215]
module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=Levgorbunov1CancelWorkflowEventsAlarm]
module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEventsAlarm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_metric_alarm.unauthorised_users_modify_repository_settings[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "unauthorised_users_modify_repository_settings" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for unauthorised repository settings modification - Group 1"
      + alarm_name                            = "UnauthorisedRepoSettingsGroup1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnauthorisedRepoSettingsGroup1"
      + namespace                             = "CustomMetrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.unauthorised_users_modify_repository_settings[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "unauthorised_users_modify_repository_settings" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for unauthorised repository settings modification - Group 2"
      + alarm_name                            = "UnauthorisedRepoSettingsGroup2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnauthorisedRepoSettingsGroup2"
      + namespace                             = "CustomMetrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.unauthorised_users_modify_repository_settings[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "unauthorised_users_modify_repository_settings" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for unauthorised repository settings modification - Group 3"
      + alarm_name                            = "UnauthorisedRepoSettingsGroup3"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnauthorisedRepoSettingsGroup3"
      + namespace                             = "CustomMetrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.unauthorised_users_modify_repository_settings[3] will be created
  + resource "aws_cloudwatch_metric_alarm" "unauthorised_users_modify_repository_settings" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for unauthorised repository settings modification - Group 4"
      + alarm_name                            = "UnauthorisedRepoSettingsGroup4"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnauthorisedRepoSettingsGroup4"
      + namespace                             = "CustomMetrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.unauthorised_users_modify_repository_settings[4] will be created
  + resource "aws_cloudwatch_metric_alarm" "unauthorised_users_modify_repository_settings" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for unauthorised repository settings modification - Group 5"
      + alarm_name                            = "UnauthorisedRepoSettingsGroup5"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnauthorisedRepoSettingsGroup5"
      + namespace                             = "CustomMetrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.unauthorised_users_modify_repository_settings[5] will be created
  + resource "aws_cloudwatch_metric_alarm" "unauthorised_users_modify_repository_settings" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for unauthorised repository settings modification - Group 6"
      + alarm_name                            = "UnauthorisedRepoSettingsGroup6"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnauthorisedRepoSettingsGroup6"
      + namespace                             = "CustomMetrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.unauthorised_users_modify_repository_settings_alarms[5].aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "UnauthorisedRepoSettingsGroup6"
      + pattern        = "{ ($.eventName = \"protected_branch.update_name\" || $.eventName = \"protected_branch.update_pull_request_reviews_enforcement_level\" || $.eventName = \"protected_branch.update_require_code_owner_review\" || $.eventName = \"protected_branch.update_require_last_push_approval\" || $.eventName = \"protected_branch.update_required_approving_review_count\" || $.eventName = \"protected_branch.update_required_status_checks_enforcement_level\" || $.eventName = \"protected_branch.update_signature_requirement_enforcement_level\" || $.eventName = \"protected_branch.update_strict_required_status_checks_policy\" || $.eventName = \"private_repository_forking.clear\" || $.eventName = \"private_repository_forking.disable\" || $.eventName = \"private_repository_forking.enable\" || $.eventName = \"dependabot_alerts.disable\" || $.eventName = \"dependabot_alerts.enable\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-github-oidc-provider\") }"

      + metric_transformation {
          + name      = "UnauthorisedRepoSettingsGroup6"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorised_users_modify_repository_settings_mod_platform_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be destroyed
  # (because aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      - id             = "UnathorisedUsersModifyRepositorySettingsEventsModPlatform" -> null
      - log_group_name = "/aws/lambda/GitHubIngestFunction" -> null
      - name           = "UnathorisedUsersModifyRepositorySettingsEventsModPlatform" -> null
      - pattern        = "{ ($.eventName = \"repo.access\" || $.eventName = \"repo.add_member\" || $.eventName = \"repo.change_merge_setting\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform\" || $.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-terraform-ec2-instance\") }" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "UnathorisedUsersModifyRepositorySettingsEventsModPlatform" -> null
          - namespace  = "GitHubMetrics" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # module.unauthorised_users_modify_repository_settings_mod_platform_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be destroyed
  # (because aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ] -> null
      - alarm_description         = "Alarm for when any user modifies the settings of ministryofjustice/modernisation-platform repository" -> null
      - alarm_name                = "UnathorisedUsersModifyRepositorySettingsEventsModPlatformAlarm" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:880656497252:alarm:UnathorisedUsersModifyRepositorySettingsEventsModPlatformAlarm" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "UnathorisedUsersModifyRepositorySettingsEventsModPlatformAlarm" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "UnathorisedUsersModifyRepositorySettingsEventsModPlatform" -> null
      - namespace                 = "GitHubMetrics" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 0 -> null
      - treat_missing_data        = "missing" -> null
    }

Plan: 7 to add, 0 to change, 2 to destroy.

```